/**
 ****************************************************************************************************
 * @file        pmu.h
 * @version     V1.0
 * @brief       待机模式 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    GD32F470VET6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __PMU_H
#define __PMU_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/
/* PMU WKUP 按键 引脚 定义 
 * 我们通过WK_UP按键(PA0 WKUP唤醒引脚)唤醒 MCU 
 */

#define PMU_WKUP_GPIO_PORT              GPIOA
#define PMU_WKUP_GPIO_PIN               GPIO_PIN_0
#define PMU_WKUP_GPIO_CLK               RCU_GPIOA     /* GPIOA时钟使能 */

/******************************************************************************************/

void pmu_wkup_key_init(void);       /* 唤醒按键初始化 */
void pmu_enter_standby(void);       /* 进入待机模式 */

#endif




















